
# tap repositories and their packages

tap 'homebrew/core'
brew 'abseil'
brew 'aom'
brew 'autoconf'
brew 'autoconf-archive'
brew 'automake'
brew 'aws-iam-authenticator'
brew 'awscli'
brew 'axel'
brew 'bash'
brew 'bat'
brew 'bc'
brew 'bdw-gc'
brew 'brotli'
brew 'c-ares'
brew 'ca-certificates'
brew 'cairo'
brew 'ccat'
brew 'certifi'
brew 'cmake'
brew 'colordiff'
brew 'coreutils'
brew 'cunit'
brew 'curl'
brew 'direnv'
brew 'expat'
brew 'fontconfig'
brew 'fontforge'
brew 'freetype'
brew 'fribidi'
brew 'gawk'
brew 'gcc'
brew 'gd'
brew 'gdbm'
brew 'gdk-pixbuf'
brew 'gettext'
brew 'gh'
brew 'ghq'
brew 'gibo'
brew 'giflib'
brew 'git'
brew 'glab'
brew 'glib'
brew 'gmp'
brew 'gnu-sed'
brew 'gnupg'
brew 'gnutls'
brew 'go'
brew 'gobject-introspection'
brew 'goenv'
brew 'graphite2'
brew 'graphviz'
brew 'grep'
brew 'gts'
brew 'guile'
brew 'harfbuzz'
brew 'helm'
brew 'highway'
brew 'htop'
brew 'hub'
brew 'icu4c@76'
brew 'icu4c@77'
brew 'imath'
brew 'inetutils'
brew 'isl'
brew 'jansson'
brew 'jasper'
brew 'jd'
brew 'jemalloc'
brew 'jpeg'
brew 'jpeg-turbo'
brew 'jpeg-xl'
brew 'jq'
brew 'kind'
brew 'kubernetes-cli'
brew 'libassuan'
brew 'libavif'
brew 'libcbor'
brew 'libdeflate'
brew 'libev'
brew 'libevent'
brew 'libffi'
brew 'libfido2'
brew 'libgcrypt'
brew 'libgit2'
brew 'libgpg-error'
brew 'libidn'
brew 'libidn2'
brew 'libksba'
brew 'libmetalink'
brew 'libmpc'
brew 'libnghttp2'
brew 'libpng'
brew 'libpthread-stubs'
brew 'librsvg'
brew 'libspiro'
brew 'libssh2'
brew 'libtasn1'
brew 'libtermkey'
brew 'libtiff'
brew 'libtommath'
brew 'libtool'
brew 'libuninameslist'
brew 'libunistring'
brew 'libusb'
brew 'libuv'
brew 'libvmaf'
brew 'libvterm'
brew 'libx11'
brew 'libxau'
brew 'libxcb'
brew 'libxdmcp'
brew 'libxext'
brew 'libxml2'
brew 'libxmlsec1'
brew 'libxrender'
brew 'libyaml'
brew 'little-cms2'
brew 'llvm'
brew 'lpeg'
brew 'luajit'
brew 'luajit-openresty'
brew 'luv'
brew 'lz4'
brew 'lzo'
brew 'm4'
brew 'mas'
brew 'mecab'
brew 'mecab-ipadic'
brew 'mpdecimal'
brew 'mpfr'
brew 'msgpack'
brew 'mysql-client'
brew 'n'
brew 'ncurses'
brew 'neovim'
brew 'netpbm'
brew 'nettle'
brew 'nghttp2'
brew 'ninja'
brew 'nkf'
brew 'node-build'
brew 'nowplaying-cli'
brew 'npth'
brew 'oath-toolkit'
brew 'oniguruma'
brew 'openexr'
brew 'openjdk@21'
brew 'openldap'
brew 'openssl@3'
brew 'p11-kit'
brew 'pango'
brew 'parallel'
brew 'parquet-cli'
brew 'pcre'
brew 'pcre2'
brew 'pinentry'
brew 'pixman'
brew 'pkgconf'
brew 'protobuf'
brew 'python@3.10'
brew 'python@3.12'
brew 'python@3.13'
brew 'python@3.8'
brew 'python@3.9'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'rtmpdump'
brew 'ruby-build'
brew 'rust'
brew 'sheldon'
brew 'six'
brew 'sphinx-doc'
brew 'sqlite'
brew 'stern'
brew 'tcl-tk'
brew 'tfenv'
brew 'thefuck'
brew 'tmux'
brew 'tpm'
brew 'tree'
brew 'tree-sitter'
brew 'unbound'
brew 'unibilium'
brew 'utf8proc'
brew 'watch'
brew 'webp'
brew 'wget'
brew 'woff2'
brew 'xorgproto'
brew 'xz'
brew 'z3'
brew 'zlib'
brew 'zsh'
brew 'zstd'

tap 'homebrew/cask'
cask 'alfred'
cask 'cursor'
cask 'deepl'
cask 'docker'
cask 'drawio'
cask 'figma'
cask 'firefox'
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-hack-nerd-font'
cask 'font-noto-sans-symbols-2'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'google-drive'
cask 'hammerspoon'
cask 'intellij-idea-ce'
cask 'mendeley'
cask 'miniconda'
cask 'miro'
cask 'notion'
cask 'slack'
cask 'visual-studio-code'

tap 'homebrew/bundle'

tap 'buildpacks/tap'
brew 'pack'

tap 'confluentinc/tap'

tap 'rcmdnk/file'
brew 'brew-file'

tap 'sanemat/font'

# App Store applications
mas 'Display Menu (2.2.5)', id: 549083868
mas 'Keynote (14.4)', id: 409183694
mas 'Okta Verify (9.44.0)', id: 490179405
mas 'Pages (14.4)', id: 409201541
mas 'RunCat (12.1)', id: 1429033973
mas 'SensiblePaster (2.0)', id: 1553906835
