tap "buildpacks/tap"
tap "confluentinc/tap"
tap "homebrew/bundle"
tap "rcmdnk/file"
tap "sanemat/font"
brew "brotli"
brew "giflib"
brew "libpng"
brew "xz"
brew "zstd"
brew "libtiff"
brew "webp"
brew "jpeg-xl"
brew "m4"
brew "autoconf"
brew "autoconf-archive"
brew "automake"
brew "aws-iam-authenticator"
brew "mpdecimal"
brew "readline"
brew "awscli"
brew "libunistring"
brew "gettext"
brew "axel"
brew "ncurses"
brew "bash"
brew "libssh2"
brew "bat"
brew "bc"
brew "bdw-gc"
brew "c-ares"
brew "freetype"
brew "fontconfig"
brew "pcre2"
brew "glib"
brew "xorgproto"
brew "libxau"
brew "libxdmcp"
brew "libxcb"
brew "libx11"
brew "libxext"
brew "libxrender"
brew "lzo"
brew "pixman"
brew "cairo"
brew "ccat"
brew "cmake"
brew "colordiff"
brew "gmp"
brew "coreutils"
brew "cunit"
brew "rtmpdump"
brew "curl"
brew "direnv"
brew "expat"
brew "fribidi"
brew "graphite2"
brew "harfbuzz"
brew "libspiro"
brew "libtool"
brew "libuninameslist"
brew "pango"
brew "fontforge"
brew "mpfr"
brew "gawk"
brew "isl"
brew "libmpc"
brew "gcc"
brew "gd"
brew "gdbm"
brew "gdk-pixbuf"
brew "gh"
brew "ghq"
brew "gibo"
brew "git"
brew "glab"
brew "gnu-sed"
brew "libevent"
brew "libidn2"
brew "libtasn1"
brew "nettle"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "libgpg-error"
brew "libgcrypt"
brew "gnupg"
brew "go"
brew "pkgconf"
brew "gobject-introspection"
brew "goenv"
brew "jasper"
brew "netpbm"
brew "gts"
brew "librsvg"
brew "graphviz"
brew "grep"
brew "guile"
brew "helm"
brew "htop"
brew "hub"
brew "icu4c@76"
brew "inetutils"
brew "jansson"
brew "jd"
brew "jemalloc"
brew "jpeg"
brew "jq"
brew "kind"
brew "kubernetes-cli"
brew "libev"
brew "libffi"
brew "libidn"
brew "libmetalink"
brew "libpthread-stubs"
brew "unibilium"
brew "libtermkey"
brew "libuv"
brew "libvterm"
brew "libxml2"
brew "libxmlsec1"
brew "luajit"
brew "luajit-openresty"
brew "luv"
brew "mas"
brew "mecab"
brew "mecab-ipadic"
brew "msgpack"
brew "mysql-client"
brew "n"
brew "utf8proc"
brew "neovim"
brew "nghttp2"
brew "ninja"
brew "nkf"
brew "node-build"
brew "nowplaying-cli"
brew "oath-toolkit"
brew "openldap"
brew "parallel"
brew "parquet-cli"
brew "pcre"
brew "protobuf"
brew "python@3.10"
brew "tcl-tk"
brew "python@3.8"
brew "python@3.9"
brew "reattach-to-user-namespace"
brew "ruby-build"
brew "rust"
brew "sheldon"
brew "sphinx-doc"
brew "stern"
brew "tfenv"
brew "thefuck"
brew "tpm"
brew "tree"
brew "watch"
brew "wget"
brew "zsh"
brew "buildpacks/tap/pack"
brew "rcmdnk/file/brew-file"
cask "alfred"
cask "cursor"
cask "deepl"
cask "docker-desktop"
cask "drawio"
cask "figma"
cask "firefox"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-noto-sans-symbols-2"
cask "gcloud-cli"
cask "google-chrome"
cask "google-drive"
cask "hammerspoon"
cask "intellij-idea-ce"
cask "mendeley"
cask "miniconda"
cask "miro"
cask "notion"
cask "slack"
cask "visual-studio-code"
mas "Display Menu", id: 549083868
mas "Keynote", id: 409183694
mas "Okta Verify", id: 490179405
mas "Pages", id: 409201541
mas "RunCat", id: 1429033973
mas "SensiblePaster", id: 1553906835
vscode "42crunch.vscode-openapi"
vscode "ajwallace.mustache-json"
vscode "alexdima.copy-relative-path"
vscode "asilverio.blackai-visual-studio-code"
vscode "attilabuti.mustache-syntax-vscode"
vscode "be5invis.toml"
vscode "be5invis.vscode-icontheme-nomo-dark"
vscode "bierner.emojisense"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bogdan-sinitsa.theme-dark-monokai"
vscode "csholmq.excel-to-markdown-table"
vscode "darkriszty.markdown-table-prettify"
vscode "davidanson.vscode-markdownlint"
vscode "dawhite.mustache"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "erd0s.terraform-autocomplete"
vscode "felipecaputo.git-project-manager"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "goessner.mdmath"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "hashicorp.terraform"
vscode "hookyqr.beautify"
vscode "humao.rest-client"
vscode "imgildev.vscode-mustache-snippets"
vscode "ionutvmi.path-autocomplete"
vscode "jithurjacob.nbpreviewer"
vscode "kisstkondoros.vscode-codemetrics"
vscode "le0zh.vscode-regexp-preivew"
vscode "lextudio.restructuredtext"
vscode "mdickin.markdown-shortcuts"
vscode "mechatroner.rainbow-csv"
vscode "mervin.markdown-formatter"
vscode "mohsen1.prettify-json"
vscode "mrmlnc.vscode-json5"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.atom-keybindings"
vscode "ms-vscode.makefile-tools"
vscode "naumovs.color-highlight"
vscode "nickfode.latex-formatter"
vscode "njpwerner.autodocstring"
vscode "orta.vscode-jest"
vscode "philosowaffle.openapi-designer"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "robertoachar.vscode-essentials-snippets"
vscode "samuelcolvin.jinjahtml"
vscode "satokaz.vscode-markdown-header-coloring"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "tamasfe.even-better-toml"
vscode "technosophos.vscode-helm"
vscode "telesoho.vscode-markdown-paste-image"
vscode "timonwong.shellcheck"
vscode "tomashubelbauer.markdown-table-of-contents"
vscode "tomashubelbauer.vscode-markdown-link-suggestions"
vscode "tomashubelbauer.vscode-markdown-todo"
vscode "tomoki1207.pdf"
vscode "tonybaloney.vscode-pets"
vscode "torn4dom4n.latex-support"
vscode "vscode-icons-team.vscode-icons"
vscode "waderyan.gitblame"
vscode "wayou.vscode-todo-highlight"
vscode "wix.vscode-import-cost"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
